tests/fixtures/dot/complex-state-machine-nomarking.gv
digraph workflow {
  ratio="compress" rankdir="LR" label=""
  node [fontsize="9" fontname="Arial" color="#333333" fillcolor="lightblue" fixedsize="false" width="1"];
  edge [fontsize="9" fontname="Arial" color="#333333" arrowhead="normal" arrowsize="0.5"];

  place_2b020927d3c6eb407223a1baa3d6ce3597a3f88d [label="start", shape=circle style="filled"];
  place_ab43a7c9cb5b2380afc4ddf8b3e2583169b39a02 [label="coding", shape=circle];
  place_e6cc0fb2b8dad4110ef62e9a33e5a8aa4e0f86d7 [label="travis", shape=circle style="filled" fillcolor="#8800FF"];
  place_61e62b213a1a56f7695845df4fc372a10cb0a73e [label="review", shape=circle];
  place_e8e2ace14fcedce073756444255d2cfe24f470af [label="merged", shape=circle];
  place_ea88fbaa99b73225752e2ef67593f775848160ad [label="closed", shape=circle style="filled" fillcolor="DeepSkyBlue"];
  place_2b020927d3c6eb407223a1baa3d6ce3597a3f88d -> place_e6cc0fb2b8dad4110ef62e9a33e5a8aa4e0f86d7 [label="My custom label" style="solid" fontcolor="Red" color="#0088FF"];
  place_ab43a7c9cb5b2380afc4ddf8b3e2583169b39a02 -> place_e6cc0fb2b8dad4110ef62e9a33e5a8aa4e0f86d7 [label="update" style="solid"];
  place_e6cc0fb2b8dad4110ef62e9a33e5a8aa4e0f86d7 -> place_e6cc0fb2b8dad4110ef62e9a33e5a8aa4e0f86d7 [label="update" style="solid"];
  place_e6cc0fb2b8dad4110ef62e9a33e5a8aa4e0f86d7 -> place_61e62b213a1a56f7695845df4fc372a10cb0a73e [label="wait_for_review" style="solid"];
  place_61e62b213a1a56f7695845df4fc372a10cb0a73e -> place_e6cc0fb2b8dad4110ef62e9a33e5a8aa4e0f86d7 [label="update" style="solid"];
  place_61e62b213a1a56f7695845df4fc372a10cb0a73e -> place_ab43a7c9cb5b2380afc4ddf8b3e2583169b39a02 [label="request_change" style="solid"];
  place_61e62b213a1a56f7695845df4fc372a10cb0a73e -> place_e8e2ace14fcedce073756444255d2cfe24f470af [label="accept" style="solid"];
  place_61e62b213a1a56f7695845df4fc372a10cb0a73e -> place_ea88fbaa99b73225752e2ef67593f775848160ad [label="reject" style="solid"];
  place_ea88fbaa99b73225752e2ef67593f775848160ad -> place_61e62b213a1a56f7695845df4fc372a10cb0a73e [label="reopen" style="solid"];
}
