tests/fixtures/puml/arrow/complex-state-machine-nomarking.puml
@startuml
allow_mixing
title pull_request
skinparam titleBorderRoundCorner 15
skinparam titleBorderThickness 2
skinparam state {
    BackgroundColor<<initial>> #87b741
    BackgroundColor<<marked>> #3887C6
    BorderColor #3887C6
    BorderColor<<marked>> Black
    FontColor<<marked>> White
    BackgroundColor<<8800FF>> #8800FF
    BackgroundColor<<DeepSkyBlue>> DeepSkyBlue
}
state "start" <<initial>>
state "coding"
state "travis" <<8800FF>> as travis
travis : My custom description
state "review"
state "merged"
state "closed" <<DeepSkyBlue>>
"start" -[#0088FF]-> "travis": "<font color=Red>My custom label</font>"
"coding" --> "travis": "update"
"travis" --> "travis": "update"
"review" --> "travis": "update"
"travis" --> "review": "wait_for_review"
"review" --> "coding": "request_change"
"review" --> "merged": "accept"
"review" --> "closed": "reject"
"closed" --> "review": "reopen"
@enduml
